In [20]:
import pandas as pd
import numpy as np
import scipy.sparse as sparse

from glob import glob
from IPython.core.interactiveshell import InteractiveShell

InteractiveShell.ast_node_interactivity = 'all'

In [6]:
paths = glob('../data/*.csv')
paths

['../data/links.csv',
 '../data/tags.csv',
 '../data/ratings.csv',
 '../data/movies.csv']

# Load data

In [7]:
links_df   = pd.read_csv(paths[0])
tags_df    = pd.read_csv(paths[1])
ratings_df = pd.read_csv(paths[3])
movies_df  = pd.read_csv(paths[4])

In [8]:
links_df.head(3)
tags_df.head(3)
ratings_df.head(3)
movies_df.head(3)

   movieId  imdbId   tmdbId
0        1  114709    862.0
1        2  113497   8844.0
2        3  113228  15602.0

   userId  movieId              tag   timestamp
0       2    60756            funny  1445714994
1       2    60756  Highly quotable  1445714996
2       2    60756     will ferrell  1445714992

   userId  movieId  rating  timestamp
0       1        1     4.0  964982703
1       1        3     4.0  964981247
2       1        6     4.0  964982224

,movieId,title,genres
0,1,Toy Story (1995),Adventure|Animation|Children|Comedy|Fantasy
1,2,Jumanji (1995),Adventure|Children|Fantasy
2,3,Grumpier Old Men (1995),Comedy|Romance

In [10]:
users = list(np.sort(ratings_df.userId.unique()))
movies = list(ratings_df.movieId.unique())
rating = list(ratings_df.rating)

In [21]:
rows = ratings_df.userId.astype('category', categories = users).cat.codes

cols = ratings_df.movieId.astype('category', categories = movies).cat.codes

user_item = sparse.csr_matrix((rating, (rows, cols)), shape=(len(users), len(movies)))

/Users/nutorbit/.pyenv/versions/miniconda3-4.3.30/lib/python3.6/site-packages/ipykernel_launcher.py:1: FutureWarning: specifying 'categories' or 'ordered' in .astype() is deprecated; pass a CategoricalDtype instead
  """Entry point for launching an IPython kernel.
/Users/nutorbit/.pyenv/versions/miniconda3-4.3.30/lib/python3.6/site-packages/ipykernel_launcher.py:3: FutureWarning: specifying 'categories' or 'ordered' in .astype() is deprecated; pass a CategoricalDtype instead
  This is separate from the ipykernel package so we can avoid doing imports until

In [22]:
user_item

<610x9724 sparse matrix of type '<class 'numpy.float64'>'
	with 100836 stored elements in Compressed Sparse Row format>

In [23]:
sparse.save_npz("../data/user_item.npz", user_item)